rikkapro0128/pic16f887/BAI_1.X/BAI_1.c
/*
 * File:   8led chop tat.c
 * Author: 84347
 *
 * Created on March 3, 2021, 7:10 AM
 */


// PIC16F887 Configuration Bit Settings

// 'C' source line config statements

// CONFIG1
#pragma config FOSC = HS        // Oscillator Selection bits (HS oscillator: High-speed crystal/resonator on RA6/OSC2/CLKOUT and RA7/OSC1/CLKIN)
#pragma config WDTE = OFF       // Watchdog Timer Enable bit (WDT disabled and can be enabled by SWDTEN bit of the WDTCON register)
#pragma config PWRTE = OFF      // Power-up Timer Enable bit (PWRT disabled)
#pragma config MCLRE = ON       // RE3/MCLR pin function select bit (RE3/MCLR pin function is MCLR)
#pragma config CP = OFF         // Code Protection bit (Program memory code protection is disabled)
#pragma config CPD = OFF        // Data Code Protection bit (Data memory code protection is disabled)
#pragma config BOREN = OFF      // Brown Out Reset Selection bits (BOR disabled)
#pragma config IESO = OFF       // Internal External Switchover bit (Internal/External Switchover mode is disabled)
#pragma config FCMEN = OFF      // Fail-Safe Clock Monitor Enabled bit (Fail-Safe Clock Monitor is disabled)
#pragma config LVP = OFF        // Low Voltage Programming Enable bit (RB3 pin has digital I/O, HV on MCLR must be used for programming)

// CONFIG2
#pragma config BOR4V = BOR40V   // Brown-out Reset Selection bit (Brown-out Reset set to 4.0V)
#pragma config WRT = OFF        // Flash Program Memory Self Write Enable bits (Write protection off)

// #pragma config statements should precede project file includes.
// Use project enums instead of #define for ON and OFF.

#define _XTAL_FREQ 4000000
#include <xc.h>
#define timeTest 400 // declare time delay 

void declarePort();
void sauLedSangDuoi();

void main(void){
    declarePort();
    while(1)
    {
       sauLedSangDuoi();
    }
}

void sauLedSangDuoi() {
    TRISB = 0b00100000;
    PORTB = 0b00001000; 
    __delay_ms(timeTest);
    TRISB = 0b00100000;
    PORTB = 0b00010000; 
    __delay_ms(timeTest);
    TRISB = 0b00001000;
    PORTB = 0b00010000;
    __delay_ms(timeTest);
    TRISB = 0b00001000;
    PORTB = 0b00100000; 
    __delay_ms(timeTest);
    TRISB = 0b00010000;
    PORTB = 0b00100000; 
    __delay_ms(timeTest);
    TRISB = 0b00010000;
    PORTB = 0b00001000; 
    __delay_ms(timeTest);
}

void declarePort() { // khai bao port
    ANSEL = ANSELH = 0;
    TRISD = 0;
    TRISC = 0;
    TRISB = 0;
    PORTB = 0;
    PORTC = 0;
    PORTD = 0;
}
